tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "bat"
brew "direnv"
brew "dust"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "mkcert"
brew "nss"
brew "pyenv"
brew "the_platinum_searcher"
brew "tree"
brew "yarn"
brew "zsh-completions"
cask "font-fira-code"
