tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "noahgorstein/tap"
brew "checkbashisms"
brew "git"
brew "git-lfs"
brew "jq"
brew "xz"
brew "tree"
cask "1password-cli"
cask "font-fira-code-nerd-font"
vscode "1Password.op-vscode"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "ChakrounAnas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-faker"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "GitLab.gitlab-workflow"
vscode "Gruntfuggly.todo-tree"
vscode "html-validate.vscode-html-validate"
vscode "ICS.japanese-proofreading"
vscode "jock.svg"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "qcz.text-power-tools"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rome.rome"
vscode "shardulm94.trailing-spaces"
vscode "sleistner.vscode-fileutils"
vscode "stylelint.vscode-stylelint"
vscode "usernamehw.errorlens"
vscode "Vue.volar"
vscode "WakaTime.vscode-wakatime"
vscode "withfig.fig"
